Revit 2026 API

# RebarUpdateCurvesDataGetHookOrientationAngle Method

---

**Note: This API is now obsolete.**

Get the termination's rotation angle at end that is currently in the rebar. The angle is used for both hook and crank.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.GetTerminationRotationAngle instead.")]
public double GetHookOrientationAngle(
	int end
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.GetTerminationRotationAngle instead.")>
Public Function GetHookOrientationAngle (
	end As Integer
) As Double
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.GetTerminationRotationAngle instead.")]
double GetHookOrientationAngle(
	int end
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.GetTerminationRotationAngle instead.")>]
member GetHookOrientationAngle :
        end : int -> float
```

#### Parameters

end Int32
     The end of bar. Should be 0 for start or 1 for end.

#### Return Value

Double The rotation angle at end that is currently in the rebar.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | Invalid end. |

#### Reference

RebarUpdateCurvesData Class

Autodesk.Revit.DB.Structure Namespace